In [1]:
import pandas as pd

In [2]:
html_file = 'sample.html'

# Extract tables into a list of DataFrames
tables = pd.read_html(html_file)

# Display the first table
df = tables[0]
print(df)

     Name  Age         City
0    John   28     New York
1   Alice   34  Los Angeles
2     Bob   22      Chicago
3   Alice   19      Newyork
4    Sita   26        India
5    Gita   28        China
6   Rohan   23      America
7  Trupti   20        India

In [3]:
df.describe()

             Age
count   8.000000
mean   25.000000
std     4.985694
min    19.000000
25%    21.500000
50%    24.500000
75%    28.000000
max    34.000000

In [4]:
df.shape

(8, 3)

In [5]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [6]:
df.head(2)

    Name  Age         City
0   John   28     New York
1  Alice   34  Los Angeles

In [8]:
df.tail(1)

     Name  Age   City
7  Trupti   20  India

In [9]:
 df.sort_index()

     Name  Age         City
0    John   28     New York
1   Alice   34  Los Angeles
2     Bob   22      Chicago
3   Alice   19      Newyork
4    Sita   26        India
5    Gita   28        China
6   Rohan   23      America
7  Trupti   20        India

In [13]:
 df.drop(0)

     Name  Age         City
1   Alice   34  Los Angeles
2     Bob   22      Chicago
3   Alice   19      Newyork
4    Sita   26        India
5    Gita   28        China
6   Rohan   23      America
7  Trupti   20        India

In [15]:
df.iloc[:,1]  #display columns whose index is 1

0    28
1    34
2    22
3    19
4    26
5    28
6    23
7    20
Name: Age, dtype: int64

In [18]:
 df['Age'].value_counts()    # Count number of rows with each unique value of variable

Age
28    2
34    1
22    1
19    1
26    1
23    1
20    1
Name: count, dtype: int64

In [20]:
df.drop_duplicates()

     Name  Age         City
0    John   28     New York
1   Alice   34  Los Angeles
2     Bob   22      Chicago
3   Alice   19      Newyork
4    Sita   26        India
5    Gita   28        China
6   Rohan   23      America
7  Trupti   20        India

In [23]:
df.iloc[3:6]       #display rows from indxes 3 to 5

    Name  Age     City
3  Alice   19  Newyork
4   Sita   26    India
5   Gita   28    China